import React, { useState } from 'react';
import Question from './Question';

const Quiz4 = () => {
    const [questions, setQuestions] = useState([
        {
            id: 1,
            question: "Қазынау құралында ниткаларды қояуды қалай ақпараттауға болады?",
            options: [
                "а) Ниткаларды қояу ақпараттау үшін машиналық жұмысты жұмсарту керек.",
                "b) Ниткаларды қояу ақпараттау үшін аппараттық түрлерді қолдану керек.",
                "c) Ниткаларды қояу ақпараттау үшін күйді сырттайтын жұмсау түрін қолдану керек"
            ],
            answer: "а) Ниткаларды қояу ақпараттау үшін машиналық жұмысты жұмсарту керек.",
            selected: "",
            isCorrect: null
        },
        {
            id: 2,
            question: "Машыналық жұмыста шовға төгу үшін не істеуге болады?",
            options: [
                "a) Шовға төгу үшін колға атқару қызметін орнату керек.",
                "b) Шовға төгу үшін машиналық шовға төгу аппаратын қолдану керек.",
                "c) Шовға төгу үшін жарықсыз шовға аппаратын қолдану керек.",
            ],
            answer: "b) Шовға төгу үшін машиналық шовға төгу аппаратын қолдану керек.",
            selected: "",
            isCorrect: null
        },
        {
            id: 3,
            question: "Машыналық жұмыс орнында не істей алады?",
            options: [
                "a) Машыналық жұмыс орнында швей машинасын іске қосу, машинаны тазалау және маслендеуге болады.",
                "b) Машыналық жұмыс орнында таспа қысымын жылжыту және айналдыру үшін жұмыс жасау керек.",
                "c) Машыналық жұмыс орнында машинаны жаңарту және құралдарды қалыптастыру үшін жұмыс жасау керек."
            ],
            answer: "a) Машыналық жұмыс орнында швей машинасын іске қосу, машинаны тазалау және маслендеуге болады.",
            selected: "",
            isCorrect: null
        },
        {
            id: 4,
            question: "Машыналық жұмыс орнындағы жұмысшының қажетті тиістері қандай?",
            options: [
                "a) Машыналық жұмыс орнында жұмысшының техническое образование қажетті.",
                "b) Машыналық жұмыс орнында жұмысшының техническое мышление және көмекшілік навыктары қажетті.",
                "c) Машыналық жұмыс орнында жұмысшының техникалық артықшылықтары және жаңа технологияларды үйрету болады."
            ],
            answer: "b) Машыналық жұмыс орнында жұмысшының техническое мышление және көмекшілік навыктары қажетті.",
            selected: "",
            isCorrect: null
        },
        {
            id: 5,
            question: "Қазынау құралында ниткалардың жиылуы қалай жүргізіледі?",
            options: [
                "a) Ниткалардың жиылуы қазынау құралында қосымша шайын ниткадан жасалады",
                "b) Ниткалардың жиылуы қазынау құралында механизмді жіберу арқылы жасалады",
                "c) Ниткалардың жиылуы қазынау құралында топтамалық жиылу механизмі арқылы жасалады"
            ],
            answer: "c) Ниткалардың жиылуы қазынау құралында топтамалық жиылу механизмі арқылы жасалады",
            selected: "",
            isCorrect: null
        },{
            id: 6,
            question: "Таспалы 20 қысымының жылжыту траекториясын табу үшін не істелуіміз керек?",
            options: [
                "a) Таспалы 20 қысымының жылжыту траекториясын табу үшін жұмысшының бейнелеу құралын пайдалану керек.",
                "b) Таспалы 20 қысымының жылжыту траекториясын табу үшін бейнелеу аппаратын пайдалану керек.",
                "c) Таспалы 20 қысымының жылжыту траекториясын табу үшін компьютерлік нысанды пайдалану керек",
            ],
            answer: "b) Таспалы 20 қысымының жылжыту траекториясын табу үшін бейнелеу аппаратын пайдалану керек.",
            selected: "",
            isCorrect: null
        },
        {
            id: 7,
            question: "Қысым 20-ның маңызын табу үшін махов колесін қандай айналдыру керек?",
            options: [
                "a) Қысым 20-ның маңызын табу үшін махов колесін машыналық жүйеде орнату керек.",
                "b) Қысым 20-ның маңызын табу үшін махов колесін механизмді жүйеде орнату керек.",
                "c) Қысым 20-ның маңызын табу үшін махов колесін машинаның бетіне орнату керек."
            ],
            answer: "c) Қысым 20-ның маңызын табу үшін махов колесін машинаның бетіне орнату керек.",
            selected: "",
            isCorrect: null
        },
        {
            id: 8,
            question: "Махов колесін дөнгелекке айналдатып, 20-ты қандай жылжытуды жасауымыз керек?",
            options: [
                "a) Махов колесін дөнгелекке айналдатып, 20-ты маятник жылжытуды жасауымыз керек.",
                "b) Махов колесін дөнгелекке айналдатып, 20-ты бағыт жылжытуды жасауымыз керек.",
                "c) Махов колесін дөнгелекке айналдатып, 20-ты центробежная жылжытуды жасауымыз керек."
            ],
            answer: "a) Махов колесін дөнгелекке айналдатып, 20-ты маятник жылжытуды жасауымыз керек.",
            selected: "",
            isCorrect: null
        },
        {
            id: 9,
            question: "Материалдарды жылжыту механизмі нелерден тұрады?",
            options: [
                "a) Материалдарды жылжыту механизмі температура және нарықтық азаматтардан тұрады.",
                "b) Материалдарды жылжыту механизмі фрикциондық күші және жылжыту бұйымдарынан тұрады.",
                "c) Материалдарды жылжыту механизмі машыналық энергия және механикалық құрамдылықтан тұрады.",
            ],
            answer: "b) Материалдарды жылжыту механизмі фрикциондық күші және жылжыту бұйымдарынан тұрады.",
            selected: "",
            isCorrect: null
        },
        {
            id: 10,
            question: "Горизонталдық шығыс рейкесінің талпынысында не орнатылады?",
            options: [
                "a) Горизонталдық шығыс рейкесінің талпынысына жылжыту құралдары орнатылады.",
                "b) Горизонталдық шығыс рейкесінің талпынысына дисковый механизм орнатылады.",
                "c) Горизонталдық шығыс рейкесінің талпынысына гидравлический привод орнатылады",
            ],
            answer: "a) Горизонталдық шығыс рейкесінің талпынысына жылжыту құралдары орнатылады",
            selected: "",
            isCorrect: null
        },
        {
            id: 11,
            question: "Маховый колесоны қалпына келтіру арқылы ігілерді қалай орнату керек?",
            options: [
                "a) Маховый колесоны қалпына келтіру арқылы ігілерді орнату үшін олардың колбасын төменге дейін енгізу керек",
                "b) Маховый колесоны қалпына келтіру арқылы ігілерді орнату үшін олардың колбасын жоғарыга дейін енгізу керек.",
                "c) Маховый колесоны қалпына келтіру арқылы ігілерді орнату үшін олардың қаралы бөлігін жоғарыга дейін енгізу керек.",
            ],
            answer: "b) Маховый колесоны қалпына келтіру арқылы ігілерді орнату үшін олардың колбасын жоғарыга дейін енгізу керек",
            selected: "",
            isCorrect: null
        },
        {
            id: 12,
            question: "Ігілерді қалай орнату керек, пазыңыздан қашыру арқылы?",
            options: [
                "a) Ігілерді қалай орнату керек, пазыңыздан қашыру арқылы, олардың жұптасындағы жапсақ енін қарау керек.",
                "b) Ігілерді қалай орнату керек, пазыңыздан қашыру арқылы, олардың жұптасындағы дөңгелекті енін қарау керек.",
                "c) Ігілерді қалай орнату керек, пазыңыздан қашыру арқылы, олардың жұптасындағы көлемін қарау керек",
            ],
            answer: "a) Ігілерді қалай орнату керек, пазыңыздан қашыру арқылы, олардың жұптасындағы жапсақ енін қарау керек.",
            selected: "",
            isCorrect: null
        },
        {
            id: 13,
            question: "Машиналық ігілердің санаттандыруында кімге назар аудару қажет?",
            options: [
                "a) Машиналық ігілердің санаттандыруында паздың жарығын көруге назар аудару қажет",
                "b) Машиналық ігілердің санаттандыруында паздың маусымдағы айналымына назар аудару қажет.",
                "c) Машиналық ігілердің санаттандыруында паздың күшіне назар аудару қажет.",
            ],
            answer: "a) Машиналық ігілердің санаттандыруында паздың жарығын көруге назар аудару қажет",
            selected: "",
            isCorrect: null
        },
        {
            id: 14,
            question: "Машиналық ігінің қалпындағы желі бойынша не көрсетілуі керек?",
            options: [
                "a) Машиналық ігінің қалпындағы желі бойынша жұптасындағы ешкі бөлігінің жақшасын көрсетуі керек.",
                "b) Машиналық ігінің қалпындағы желі бойынша жұптасындағы ішкі бөлігінің жақшасын көрсетуі керек.",
                "c) Машиналық ігінің қалпындағы желі бойынша жұптасындағы жылытын бөлігінің жақшасын көрсетуі керек.",
            ],
            answer: "a) Машиналық ігінің қалпындағы желі бойынша жұптасындағы ешкі бөлігінің жақшасын көрсетуі керек.",
            selected: "",
            isCorrect: null
        },
        {
            id: 15,
            question: "Машиналық ігінің орнатуында пайдалануға арналған құралдарды қашан пайдалану керек?",
            options: [
                "a) Машиналық ігінің орнатуында пайдалануға арналған күмісті шақыру, жеңілдету жұмысын орындау және винтпен байланыстыру қажет",
                "b) Машиналық ігінің орнатуында пайдалануға арналған шайбаларды шақыру, жеңілдету жұмысын орындау және винтпен байланыстыру қажет.",
                "c) Машиналық ігінің орнатуында пайдалануға арналған жуғыштарды шақыру, жеңілдету жұмысын орындау және винтпен байланыстыру қажет.",
            ],
            answer: "c) Машиналық ігінің орнатуында пайдалануға арналған жуғыштарды шақыру, жеңілдету жұмысын орындау және винтпен байланыстыру қажет.",
            selected: "",
            isCorrect: null
        }
        // Add more questions here
    ]);

    const handleOptionSelect = (questionId, selectedOption) => {
        const updatedQuestions = questions.map(question => {
            if (question.id === questionId) {
                const isCorrect = selectedOption === question.answer;
                return { ...question, selected: selectedOption, isCorrect };
            }
            return question;
        });
        setQuestions(updatedQuestions);
    };

    const handleSubmit = () => {
        const updatedQuestions = questions.map(question => {
            const isCorrect = question.selected === question.answer;
            return { ...question, isCorrect };
        });
        setQuestions(updatedQuestions);
    };

    const score = questions.filter(question => question.isCorrect).length;
    const totalQuestions = questions.length;

    return (
        <div className="quiz">
            {questions.map(question => (
                <Question
                    key={question.id}
                    question={question}
                    handleOptionSelect={handleOptionSelect}
                />
            ))}
            <button onClick={handleSubmit}>Жіберу</button>

            {questions.every(question => question.isCorrect !== null) && (
                <div className="results">
                    <h2>Нәтиже</h2>
                    <p>Бал: {score}/{totalQuestions}</p>
                </div>
            )}
        </div>
    );
};

export default Quiz4;
